notes/live-coding/10-02-infinite-data-in-Scala.tex
% Created 2020-10-02 Fri 13:23
% Intended LaTeX compiler: lualatex
\documentclass[11pt]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{tabularx}
\usepackage{etoolbox}
\makeatletter
\def\dontdofcolorbox{\renewcommand\fcolorbox[4][]{##4}}
\AtBeginEnvironment{minted}{\dontdofcolorbox}
\makeatother
\usepackage[newfloat]{minted}
\usepackage{unicode-math}
\usepackage{unicode}
\author{Mark Armstrong}
\date{\today}
\title{Infinite data in Scala}
\hypersetup{
   pdfauthor={Mark Armstrong},
   pdftitle={Infinite data in Scala},
   pdfkeywords={},
   pdfsubject={We discuss the notion of “infinite data”, and show how we can represent such data in Scala.},
   pdfcreator={Emacs 27.0.90 (Org mode 9.4)},
   pdflang={English},
   colorlinks,
   linkcolor=blue,
   citecolor=blue,
   urlcolor=blue
   }
\begin{document}

\maketitle
\tableofcontents


\section{Introduction}
\label{sec:orga6f503f}
These notes were created for, and in some parts \textbf{during},
the lecture on October 2nd and the following tutorials.

\section{Motivation}
\label{sec:org8865573}
In our current lectures, we have been discussing the λ-calculus,
and as of the time of writing this, we are about to discuss
reduction strategies.

The reduction strategies used in the λ-calculus
correspond to the parameter-passing methods
used in conventional programming languages; specifically:

\section{Call by value and call by name}
\label{sec:org11ed657}

Today, we are interested in the
“call by value” and “call by name”
reduction strategies/parameter-passing methods.
\begin{itemize}
\item Under a “call by value” strategy,
a function application is only evaluated after
its arguments have been reduced to values.
\item Under a “call by name” (or “call by need”) strategy,
no arguments in a function application are evaluated before
the function is applied.
\begin{itemize}
\item (And no reduction is allowed inside abstractions.)
\end{itemize}
\end{itemize}

(Under both schemes, the leftmost, outermost valid reduction is done first.)

We can see the difference by considering a sample redex
in the λ-calculus.
\begin{minted}[breaklines=true]{text}
(λ x → x x)((λ y → y) (λ z → z))
\end{minted}
Notice that there are two possible applications to carry out;
applying \texttt{y} to \texttt{λ x → x}, or applying \texttt{(λ x → x) y} to \texttt{λ x → x x}.

A call-by-value strategy requires that the right side be evaluated first;
“a function application is only evaluated
after its arguments have been reduced to values”.
So we cannot perform the outmost application until the term on the right
is reduced.
\begin{minted}[breaklines=true]{text}
  (λ x → x x)((λ y → y) (λ z → z))
⟶ (λ x → x x)(λ z → z)
⟶ (λ z → z) (λ z → z)
→ λ z → z
= id
\end{minted}

A call-by-need strategy instead requires that the outside
application is evaluated first;
“no arguments in a function application are evaluated before
the function is applied”.
So we cannot perform the application in the term on the right
until we apply the outermost application.
\begin{minted}[breaklines=true]{text}
  (λ x → x x)((λ y → y) (λ z → z))
⟶ ((λ y → y) (λ z → z)) ((λ y → y) (λ z → z))
→ (λ z → z) ((λ y → y) (λ z → z))
→ (λ y → y) (λ z → z)
→ λ z → z
= id
\end{minted}

\section{Parameter passing in Scala}
\label{sec:orgaa8f79b}

By default, Scala uses a call-by-value strategy.
\begin{minted}[breaklines=true]{scala}
def f(x: Int): Unit = { println("Called f with argument"); println(x) }
\end{minted}

You may \emph{opt-in} to call by name using what they call “by name parameters”;
simply prepend \texttt{=>} to the type.
\begin{minted}[breaklines=true]{scala}
def g(y: => Int) : Unit = { println("Called g with argument"); println(y) }
\end{minted}

Let us create a value that is not immediately evaluated,
and which communicates when it is evaluated,
so we can use it as an argument to test out our above definitions.
One way to do this is by defining it as a method with no parameters.
\begin{minted}[breaklines=true]{scala}
def x: Int = { println("Evaluated x"); 1 }
\end{minted}

Scala also has “lazy” values, which are not evaluated until used.
:TODO: how is this different than x?
\begin{minted}[breaklines=true]{scala}
lazy val y: Int = { println("Evaluated y"); 2 }
\end{minted}

\section{What's the point?}
\label{sec:org8363a6f}

Why do we want to be allowed to use call by name semantics
and lazy values?

It may make some tasks easier conceptually;
for instance, one common use case involves a function
on the natural numbers, such as one that returns the “nth” prime.

We could certainly write such a function,
but an alternative approach is to \emph{lazily} construct
the list of all primes by \emph{filtering} the list of all naturals.
Since it is lazily constructed, no space is used
until we begin to look up elements in the list.
(Code courtesy of this \href{https://stackoverflow.com/q/15594227/2041536}{StackOverflow} post,
modified to work with \texttt{LazyList}.)
\begin{minted}[breaklines=true]{scala}
lazy val ps: LazyList[Int] =
  2 #:: LazyList.from(3).filter(i => ps.takeWhile{j => j * j <= i}.forall{ k => i % k > 0});
\end{minted}

And, because lazy data is not re-evaluated,
once we have looked up elements, the already calculated portion
of the list is automatically cached for us!
This is (in some instances) an advantage over the function.

Now, we have subtlely used another concept enabled by lazy values
and call-by-name semantics in the above: an infinite list!

\section{Infinite data!}
\label{sec:org8e94b3b}

\subsection{Not with lists…}
\label{sec:orgadc97be}

When we discuss lists in computer science,
they are usually defined as having \emph{finite} length.

Let us try to break away from that convention.
We can define an infinite list by using recursion.
But what does you intuition tell you will happen here?
\begin{minted}[breaklines=true]{scala}
lazy val ones: List[Int] = 1 :: ones
\end{minted}

\subsection{…instead, with lazy lists or streams!}
\label{sec:org61bd68e}

The \href{https://www.scala-lang.org/api/current/scala/collection/immutable/LazyList.html}{lazy list} type and
the (now deprecated in favour of lazy lists) \href{https://www.scala-lang.org/api/current/scala/collection/immutable/Stream.html}{Stream} type
actually allow us to define such lists.
\begin{minted}[breaklines=true]{scala}
lazy val ones: LazyList[Int] = 1 #:: ones
\end{minted}

We can then make these lists more interesting
by filtering, zipping, etc.;
or by writing more interesting recursive definitions.

\section{Implementing our own infinite datatypes}
\label{sec:org31e440d}

We certainly can implement our own types of infinite data in Scala.

Unfortunately, we cannot do so using the “algebraic datatype”
approach we have been using.
And at least in this exercise, we are not going to
investigate how to construct these types in Scala.

In other functional languages, in particular Haskell,
which uses call-by-need semantics (a more performant
take on call-by-name), defining your own infinite datatypes
is simpler.
\end{document}
